tap 'beeftornado/rmtree'  # Installs rmtree

# Fonts
tap 'caskroom/fonts'
cask 'font-source-code-pro'

# caskroom/cask
tap 'caskroom/cask'
cask 'alfred'
cask 'android-platform-tools'
cask 'displaycal'
cask 'docker'
cask 'dozer'
cask 'drawio'
cask 'firefox'
cask 'flash-npapi'  # Work
cask 'libreoffice'
cask 'skim'
cask 'slack'
cask 'switchresx'
cask 'telegram'  # Personal
cask 'whichspace'
cask 'osxfuse'  # Required by sshfs
cask 'wkhtmltopdf'  # Required by pandoc to create files

# yabai
tap 'koekeishiya/formulae'
brew 'yabai'
brew 'skhd'

# iTerm2
tap 'caskroom/versions'
cask 'iterm2-beta'

# Homebrew packages
# GNU utilities
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'
# Shell utilities
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'source-highlight'
brew 'tree'
# Utilities without Cask dependencies
brew 'ansible'
brew 'aria2'
brew 'atool'
brew 'htop'
brew 'ipmitool'
brew 'neovim'
brew 'openssh'
brew 'p7zip'
brew 'pandoc'
brew 'picocom'
brew 'sipcalc'
brew 'speedtest-cli'
brew 'wget'
# Utilities with Cask dependencies
brew 'sshfs'

# QMK build tools
# https://docs.qmk.fm/#/getting_started_build_tools?id=macos
brew 'avrdude'
brew 'dfu-programmer'
brew 'dfu-util'
tap 'osx-cross/avr'
brew 'avr-gcc@7'
tap 'PX4/homebrew-px4'
brew 'gcc-arm-none-eabi'

# Mac App Store
mas 'Helium', id: 1054607607

