# Casks
tap 'homebrew/cask'  # Explicitly tap to keep during `brew bundle cleanup`
cask 'android-platform-tools'
cask 'displaycal'
cask 'docker'
cask 'dozer'
cask 'drawio'
cask 'firefox'
cask 'flash-npapi'  # Work
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'launchbar'
cask 'libreoffice'
cask 'libreoffice-language-pack'
cask 'microsoft-teams'
cask 'skim'
cask 'slack'
cask 'switchresx'
cask 'telegram'
cask 'the-unarchiver'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'osxfuse'  # Required by sshfs
cask 'wkhtmltopdf'  # Used by pandoc to create files
# Drivers
tap 'homebrew/cask-drivers'
cask 'linn-konfig'  # Not a driver, here due to Cask rules: https://git.io/fjb4S

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro'

# Homebrew packages
brew 'ansible'
brew 'aria2'
brew 'curl'
brew 'git'
brew 'htop'
brew 'ipmitool'
brew 'jq'
brew 'less'
brew 'letsencrypt'
brew 'neovim'
brew 'openssh'
brew 'pandoc'
brew 'picocom'
brew 'python'
brew 'sipcalc'
brew 'source-highlight'
brew 'speedtest-cli'
brew 'tree'
brew 'unar'
brew 'wget'
brew 'xz'
# GNU utilities
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'
brew 'gzip'
# Zsh
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
# Utilities with Cask dependencies
brew 'sshfs'

# Services
tap 'homebrew/services'  # Explicitly tap to keep during `brew bundle cleanup`
# Window manager
tap 'koekeishiya/formulae'
brew 'yabai'
brew 'skhd'

# QMK build tools
# https://docs.qmk.fm/#/getting_started_build_tools?id=macos
brew 'avrdude'
brew 'dfu-programmer'
brew 'dfu-util'
tap 'osx-cross/avr'
brew 'avr-gcc@8'
tap 'PX4/homebrew-px4'
brew 'gcc-arm-none-eabi'
